export default {
  projections: {
    ЗаказE: {
      статус: {
        __caption__: 'Статус'
      },
      цена: {
        __caption__: 'Цена'
      },
      дата: {
        __caption__: 'Дата'
      },
      клиент: {
        __caption__: 'Клиент',
        номер: {
          __caption__: ''
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        табНом: {
          __caption__: ''
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      строкаЗаказа: {
        __caption__: 'Строка заказа',
        количество: {
          __caption__: 'Количество'
        },
        сумма: {
          __caption__: 'Сумма'
        },
        название: {
          __caption__: 'Название'
        },
        цена: {
          __caption__: 'Цена'
        },
        товар: {
          __caption__: 'Товар',
          название: {
            __caption__: 'Название'
          }
        }
      }
    },
    ЗаказL: {
      статус: {
        __caption__: 'Статус'
      },
      цена: {
        __caption__: 'Цена'
      },
      дата: {
        __caption__: 'Дата'
      },
      сотрудник: {
        __caption__: '',
        табНом: {
          __caption__: ''
        }
      },
      клиент: {
        __caption__: '',
        номер: {
          __caption__: ''
        },
        кодК: {
          __caption__: ''
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    статус: {
      __caption__: 'Статус'
    },
    цена: {
      __caption__: 'Цена'
    },
    клиент: {
      __caption__: 'Клиент'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    },
    строкаЗаказа: {
      __caption__: 'Строка заказа'
    }
  }
};
