export default {
  projections: {
    СтрокаЗаказаE: {
      количество: {
        __caption__: 'Количество'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      название: {
        __caption__: 'Название'
      },
      цена: {
        __caption__: 'Цена'
      },
      товар: {
        __caption__: 'Товар',
        название: {
          __caption__: 'Название'
        }
      }
    }
  },
  validations: {
    количество: {
      __caption__: 'Количество'
    },
    название: {
      __caption__: 'Название'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    цена: {
      __caption__: 'Цена'
    },
    товар: {
      __caption__: 'Товар'
    },
    заказ: {
      __caption__: 'заказ'
    }
  }
};
