export default {
  projections: {
    КлиентE: {
      номер: {
        __caption__: 'Номер'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      кодК: {
        __caption__: 'Код К'
      }
    },
    КлиентL: {
      номер: {
        __caption__: 'Номер'
      },
      отчество: {
        __caption__: 'Отчество'
      },
      фамилия: {
        __caption__: 'Фамилия'
      },
      имя: {
        __caption__: 'Имя'
      },
      кодК: {
        __caption__: 'Код К'
      }
    }
  },
  validations: {
    имя: {
      __caption__: 'Имя'
    },
    кодК: {
      __caption__: 'Код К'
    },
    номер: {
      __caption__: 'Номер'
    },
    отчество: {
      __caption__: 'Отчество'
    },
    фамилия: {
      __caption__: 'Фамилия'
    }
  }
};
